app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
    def show # instance method
        @post = Post.find(params[:id]) # creating instance variable which is a specific id of the post